{"_path":"/portfolio/project-constellation","_dir":"portfolio","_draft":false,"_partial":false,"_locale":"","title":"Project Constellation","description":"The ideal sales framework for sharing simplified workflows and solutions across a wide network of service offerings.","activity":"Interactive Sales Tool","video":"Xerox","cover":"/project-media/xerox/xerox-1.jpg","year":2020,"body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"the-ideal-sales-framework-for-sharing-simplified-workflows-and-solutions-across-a-wide-network-of-service-offerings"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"The ideal sales framework for sharing simplified workflows and solutions across a wide network of service offerings."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In 2020 I was part of a creative development project that built a prototype web experience to support consultative and customer-centric conversations between a business and its customers. The prototype was designed to unify the business story across horizontals and verticals and to allow salespeople to explore real business challenges that their customers were facing."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"xerox-1.jpg","src":"/project-media/xerox/xerox-1.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The goal of the prototype was to create a visual map of the business ecosystem that would convey its power and impact on businesses that use it. This visual, interactive combined workflow mapper and solution playbook was designed to be dynamic and to grow with the expanding catalog of service offerings and target markets."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It featured fluid level-based navigation to easily handle non-linear conversations and paths, zooming and flying in through various workflows - facilitating exploration. It was designed to connect the dots on all service offerings available, even if they weren't immediately related to the customer's current needs. This was intended to solve a problem of lack of awareness when it came to the client’s expanded offerings, opening the door to extended conversations that focused on more than just what they needed “right now”. It used spatial organization to reveal connections based on customer profile, challenges, industry, market, interests and promotional initiatives. Finally, it easily surfaced applicable case studies and product demos when getting down to the solution level."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"xerox-3.jpg","src":"/project-media/xerox/xerox-3.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"My role on the project was lead creative developer, handling the architecture and visual representation of the “graph” system. The application was built in Vue for browser-based usage duration presentational meetings. The development process took place in several sprints, from concepting/prototyping to design treatments and production development. I had the pleasure of working alongside Sosolimited in Boston to bring this one to life."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The frontend was a Vue application, with a major dividing line structurally between the main \"graph\" experience and the supporting UI chrome, allowing for a separation of concerns between multiple developers without constant merge conflicts. The backend was built with Express, with the goal of providing a simple and stable JSON API in front of a content management system "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"(Contentful)"}]},{"type":"text","value":". The devOps for staging and testing ran on Heroku."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"xerox-2.jpg","src":"/project-media/xerox/xerox-2.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Within the Vue application, I built a workflow system that used a virtual 2D camera and calculated for various levels of 3D depth and focal points alongside art-directable offsets. Additionally, I built automatic diagramming that drew connection lines between associated nodes and animated them on, adding arrow heads and understanding the context of each target node’s anchor point. Lastly, I attached local assets that matched up with a database so that users could select any one of the available assets within the tool, including icons, PDFs, case studies, demo videos and more."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:portfolio:8.project-constellation.md","_source":"content","_file":"portfolio/8.project-constellation.md","_stem":"portfolio/8.project-constellation","_extension":"md"}