{"_path":"/portfolio/frontend-nation-2024","_dir":"portfolio","_draft":false,"_partial":false,"_locale":"","title":"Frontend Nation 2024","description":"Crafting completely crazy and collectively constructive creative coding concoctions.","activity":"Talk","componentName":"FrontendNation2024","video":"fen24","cover":"/project-media/frontend-nation-2024/poster.jpg","year":2024,"body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"talk-crafting-completely-crazy-and-collectively-constructive-creative-coding-concoctions"},"children":[{"type":"text","value":"Talk: Crafting completely crazy and collectively constructive creative coding concoctions."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In June 2024 I had the opportunity to speak at "},{"type":"element","tag":"a","props":{"href":"https://frontendnation.com","rel":["nofollow"]},"children":[{"type":"text","value":"Frontend Nation"}]},{"type":"text","value":", the largest online frontend event in the world, alongside a bunch of talented frontend developers. My talk was to be titled "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"\"crafting completely crazy and collectively constructive creative coding concoctions\""}]},{"type":"text","value":"."}]},{"type":"element","tag":"tweet","props":{"url":"https://twitter.com/frontendnation/status/1826987706808680911"},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I was the final speaker on Day 3, closing out the event by delivering a talk that provided no educational value at all, instead opting to inspire and have some fun with the participants in a highly interactive 3D experience running in the browser. Using frontend tools such as "},{"type":"element","tag":"code","props":{"className":[]},"children":[{"type":"text","value":"Threejs"}]},{"type":"text","value":" and "},{"type":"element","tag":"code","props":{"className":[]},"children":[{"type":"text","value":"PartyKit"}]},{"type":"text","value":" I crafted an immersive factory experience where participants played as rubber duckies driving forklifts in real-time - with the goal of building a new creative landing page hero section."}]},{"type":"element","tag":"h3","props":{"id":"early-development"},"children":[{"type":"text","value":"Early development"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Who knows where the idea came from, but early on I decided one of the interactive “toys” participants would interact with would be a forklift. I set out to build a proof-of-concept using a forklift 3D model and building a few physics bounding boxes around it. Working with a segmented mesh "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"(where the lift mesh was not attached to the main body)"}]},{"type":"text","value":" allowed me to add "},{"type":"element","tag":"code","props":{"className":[]},"children":[{"type":"text","value":"gsap"}]},{"type":"text","value":" animations to both the mesh and physics body to raise/lower the forklift."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"An early test included using a pallet and some traffic cones/barricades that could be ran into. If I could control the forklift and successfully move some traffic cones around an empty space, then the rest would just be icing on the cake."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Early prototypes of the forklift and sample physics objects","src":"/project-media/frontend-nation-2024/early-prototype.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Once I was happy with the proof-of-concept, I moved onto to implementing this at scale. I approached development with an object-oriented mindset, building TS classes representing base physics toys, props, structures, and rooms. This allowed me to build upon base functionality, such as automatically-generated physics bounding boxes and contact materials. Structuring code this way enabled me to create scenes at scale that would have otherwise taken me significantly longer otherwise."}]},{"type":"element","tag":"h3","props":{"id":"world-building"},"children":[{"type":"text","value":"World-building"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of the most impactful decisions I made along the way was to treat this like a video game more than a web experience, pulling from well-known video game development techniques to optimize for performance. Each “room” was divided using a pair of rolling garage doors that acted like airlocks. Once the camera entered the “airlock”, the previous room’s resources were disposed of and the scene got reset back to "},{"type":"element","tag":"code","props":{"className":[]},"children":[{"type":"text","value":"{x: 0, y: 0, z: 0}"}]},{"type":"text","value":" . This logic provided for segmentation during development - I could swap between scenes easily, re-order them, and never worry about keeping multiple scene's resources in memory at once."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The red outlines below represents the physics bodies in the scene. Nearly everything in the scene had a physics body for collisions. This image also shows the modular approach to level development, using a grid to build up the floors, ramps and walls."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Outlines showing physics bodies","src":"/project-media/frontend-nation-2024/dom-room.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Excluding structures, over 70+ unique physics props were created for participants to engage with, ranging from the pallets of npm packages and DOM elements of various types/sizes to barricades, speaker cards, railings and more. Each one had it’s own properties and logic, running on top of a parent class with automatic lifecycle management to ensure models, textures and materials were cached and disposed of when needed. Certain props, like storage racks, hooked into this lifecycle to run additional logic, like adding cardboard boxes to the rack’s shelves as separate physics objects."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Although hard to spot during the madness, there were a ton of small details and easter eggs to discover - such as some non-standard css properties and posters with inspirational messages such as “"},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"let’s get this bread"}]},{"type":"text","value":"”."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"3D representations of the box object model","src":"/project-media/frontend-nation-2024/css-room.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of my favorite scenes of the entire talk was the fragment shader room. It took a decent bit of manual work to build up a hex grid of colors to play with - and the result of this with 15 forklifts pushing them all over the place was crazy. This was also one of the more intensive rooms resource-wise, as it required more connections for all of the forklift interactivity and more physics bodies to support all the hex codes. This one scene actually uses more \"loose\" physics parameters to improve on framerate performance, at the expense of accuracy. This led to some weird things happening, but it visually made sense during the madness of this scene."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"hex-codes.jpg","src":"/project-media/frontend-nation-2024/hex-codes.jpg"},"children":[]}]},{"type":"element","tag":"h3","props":{"id":"falling-apart"},"children":[{"type":"text","value":"Falling apart"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of the core messages of the talk was to emphasize that creative coding is a process of exploration - and that making mistakes was a part of that process. I didn't want things to go perfectly, opting instead to have it crash and burn intentionally."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The original ending, shown below, would take the Frontend Nation logo and drop it into place. Doing so would disrupt the landing page below and scatter the elements, and I'd close out on the aforementioned message."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"The original ending","src":"/project-media/frontend-nation-2024/deployment-room.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But that didn't quite feel right. Somewhere, admittedly fairly late in planning for the talk, it dawned on me that I might want to store screen-captures of the factory experience along the way. I'd already developed a process early in prototyping to save out image data for the sake of potentially streaming it to attendees, but this seemed like a better fit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Within a couple of days, I built out a process that captured low-resolution media during the entire talk, and then compiled it in real-time at the end of the talk to build the Frontend Nation logo back in the original 3D scene. It's sort of trippy when you think about - those are screenshots of the current 3D scene, within the 3D scene itself. The result here being a single high-resolution artwork representing the talk in full, emphasizing that the process of building and giving the talk itself is what led to this artwork being generated through exploration."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"final-artwork.jpg","src":"/project-media/frontend-nation-2024/final-artwork.jpg"},"children":[]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"talk-crafting-completely-crazy-and-collectively-constructive-creative-coding-concoctions","depth":2,"text":"Talk: Crafting completely crazy and collectively constructive creative coding concoctions.","children":[{"id":"early-development","depth":3,"text":"Early development"},{"id":"world-building","depth":3,"text":"World-building"},{"id":"falling-apart","depth":3,"text":"Falling apart"}]}]}},"_type":"markdown","_id":"content:portfolio:3.frontend-nation-2024.md","_source":"content","_file":"portfolio/3.frontend-nation-2024.md","_stem":"portfolio/3.frontend-nation-2024","_extension":"md"}