{"_path":"/portfolio/the-engine-at-mit","_dir":"portfolio","_draft":false,"_partial":false,"_locale":"","title":"The Engine @ MIT","description":"A content-driven infographic showcasing tough tech, displayed on a floor-to-ceiling LED wall at MIT's The Engine in Boston.","activity":"Digital Art Installation","componentName":"TheEngine","video":"the-engine","cover":"/project-media/the-engine/the-engine-3.jpg","year":2022,"body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"an-innovative-content-driven-artwork-for-new-headquarters-of-the-engine-at-mit-designed-to-engage-audiences-both-within-and-beyond-the-walls-of-the-new-space"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"An innovative content-driven artwork for new headquarters of The Engine at MIT"}]},{"type":"text","value":" — "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"designed to engage audiences both within and beyond the walls of the new space."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Engine, a Cambridge-based venture fund, was looking for a creative way to showcase the companies and founders that work at their headquarters, as well as the problems that they are solving. I worked alongside Sosolimited to create a content-driven digitally-rendered artwork that would position The Engine and Tough Tech beyond the walls of the new headquarters, and express the transformative significance of the problems being tackled by the founders and their companies. The artwork was designed for a screen measuring 22' high and 11' wide, in the lobby of their new space, with a 4K resolution and dynamic content streaming from multiple sources."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"the-engine-1.jpg","src":"/project-media/the-engine/the-engine-1.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Our challenge was to create an application that highlighted The Engine’s brand and design principles while accepting various types of data input and edge cases, so that the artwork could best represent all of the activities at The Engine."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"the-engine-animation.gif","src":"/project-media/the-engine/the-engine-animation.gif"},"children":[]}]},{"type":"element","tag":"h3","props":{"id":"architecture"},"children":[{"type":"text","value":"Architecture"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The application was built using Vue and Electron, with a custom pipeline for rendering "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"“axis”"}]},{"type":"text","value":" of data to the screen. With a target minimum of 60fps @ 4K and a highly complex visual to render, every graphical element on-screen was scrutinized. Novel methods were developed for attaching HTML5 canvas rendering to Vue’s reactivity system, so that frames would only be drawn when the content needed to animate. We also employed a “LOD” "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"(level-of-detail)"}]},{"type":"text","value":" approach to animation complexity — so that elements had higher resolution when static, and lower resolution when moving."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"the-engine-2.png","src":"/project-media/the-engine/the-engine-2.png"},"children":[]}]},{"type":"element","tag":"h3","props":{"id":"data"},"children":[{"type":"text","value":"Data"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Data for the visualizations came from multiple sources. Core content such as companies, key themes, and statistics were delivered using GraphQL via Contentful. Real-time feeds such as Twitter and website articles were passed through a custom-built middleware that provided a layer of data conformity and caching, whilst also implementing additional search and filter logic and bypassing CORS restrictions. We also built a Slack bot for a private channel, to monitor the latest news and  articles shared by employees and associate those with the correct companies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"the-engine-animation-2.gif","src":"/project-media/the-engine/the-engine-animation-2.gif"},"children":[]}]},{"type":"element","tag":"h3","props":{"id":"conclusion"},"children":[{"type":"text","value":"Conclusion"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The end product was an innovative and sophisticated content-driven artwork that successfully positioned The Engine and Tough Tech beyond the walls of the new headquarters, and expressed the transformative significance of the problems that founders and their companies are tackling. The application was designed to engage audiences at hosted and public events, the general community, and to investors across the capital stack as well as strategic partners."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The flexibility of the code allowed for faster structural changes, making last-minute tweaks feasible. This project demonstrated Sosolimited's ability to develop advanced, customized solutions in order to achieve the client’s goals, and I was happy to help bring that to life with some creative code."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"architecture","depth":3,"text":"Architecture"},{"id":"data","depth":3,"text":"Data"},{"id":"conclusion","depth":3,"text":"Conclusion"}]}},"_type":"markdown","_id":"content:portfolio:4.the-engine-at-mit.md","_source":"content","_file":"portfolio/4.the-engine-at-mit.md","_stem":"portfolio/4.the-engine-at-mit","_extension":"md"}